# Pandas Basics_06_apply(),map() and applymap()

In [1]:
import pandas as pd

In [4]:
sales = pd.read_csv('sales.csv',index_col = 0)

In [5]:
sales

        Mon  Tue  Wed   Thu  Fri
Steven   34   27   15   NaN   33
Mike     45    9   74  87.0   12
Andi     17   33   54   8.0   29
Paul     87   67   27  45.0    7

In [6]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Steven to Paul
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Mon     4 non-null      int64
 1   Tue     4 non-null      int64
 2   Wed     4 non-null      int64
 3   Thu     3 non-null      float64
 4   Fri     4 non-null      int64
dtypes: float64(1), int64(4)
memory usage: 192.0+ bytes

In [7]:
#Column wise minimum retrieval
sales.min(axis=0)

Mon    17.0
Tue     9.0
Wed    15.0
Thu     8.0
Fri     7.0
dtype: float64

In [8]:
#Row wise minimum retrieval
sales.min(axis=1)

Steven    15.0
Mike       9.0
Andi       8.0
Paul       7.0
dtype: float64

In [9]:
#Function to findout the range difference on Panda series (Sales)
def range(series):
    return series.max()-series.min()

In [10]:
#Row wise range difference find
sales.apply(range,axis=1)

Steven    19.0
Mike      78.0
Andi      46.0
Paul      80.0
dtype: float64

In [11]:
#Column wise range difference find
sales.apply(range,axis=0)

Mon    70.0
Tue    58.0
Wed    59.0
Thu    79.0
Fri    26.0
dtype: float64

In [13]:
#Defining function using lambda instead of seperate function
sales.apply(lambda series: series.max()-series.min(),axis=0)

Mon    70.0
Tue    58.0
Wed    59.0
Thu    79.0
Fri    26.0
dtype: float64

In [15]:
#Defining function using lambda instead of seperate function by renaming series as x
sales.apply(lambda x: x.max()- x.min(),axis=1)

Steven    19.0
Mike      78.0
Andi      46.0
Paul      80.0
dtype: float64

In [16]:
summer = pd.read_csv('summer.csv')

In [17]:
summer

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver
...,...,...,...,...,...,...,...,...,...
31160,2012,London,Wrestling,Wrestling Freestyle,"JANIKOWSKI, Damian",POL,Men,Wg 84 KG,Bronze
31161,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold
31162,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver
31163,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze
31164,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze

In [20]:
#Pandas.apply allow the users to pass a function and apply it on every single value of the Pandas SERIES.
summer.Athlete.apply(lambda x: x[0])

0        H
1        H
2        D
3        M
4        C
        ..
31160    J
31161    R
31162    T
31163    A
31164    L
Name: Athlete, Length: 31165, dtype: object

In [37]:
#The map() function is used to map values of Series according to input correspondence.
summer.Athlete.map(lambda x: x[0])

0        H
1        H
2        D
3        M
4        C
        ..
31160    J
31161    R
31162    T
31163    A
31164    L
Name: Athlete, Length: 31165, dtype: object

In [24]:
summer.iloc[:,1:4]

         City      Sport           Discipline
0      Athens   Aquatics             Swimming
1      Athens   Aquatics             Swimming
2      Athens   Aquatics             Swimming
3      Athens   Aquatics             Swimming
4      Athens   Aquatics             Swimming
...       ...        ...                  ...
31160  London  Wrestling  Wrestling Freestyle
31161  London  Wrestling  Wrestling Freestyle
31162  London  Wrestling  Wrestling Freestyle
31163  London  Wrestling  Wrestling Freestyle
31164  London  Wrestling  Wrestling Freestyle

[31165 rows x 3 columns]

In [41]:
#The applymap() function is used to apply a function to a DATAFRAME elementwise
summer.iloc[:,1:4].applymap(lambda x:x[0:2])

      City Sport Discipline
0       At    Aq         Sw
1       At    Aq         Sw
2       At    Aq         Sw
3       At    Aq         Sw
4       At    Aq         Sw
...    ...   ...        ...
31160   Lo    Wr         Wr
31161   Lo    Wr         Wr
31162   Lo    Wr         Wr
31163   Lo    Wr         Wr
31164   Lo    Wr         Wr

[31165 rows x 3 columns]

In [31]:
#Userdefined function to calculate sales margin of 40% along with daily fixed cost of 5
sales.iloc[:,0:].applymap(lambda x: (0.4*x)-5)

         Mon   Tue   Wed   Thu  Fri
Steven   8.6   5.8   1.0   NaN  8.2
Mike    13.0  -1.4  24.6  29.8 -0.2
Andi     1.8   8.2  16.6  -1.8  6.6
Paul    29.8  21.8   5.8  13.0 -2.2

In [32]:
#Above code can be easily done as below too
sales*0.4-5

         Mon   Tue   Wed   Thu  Fri
Steven   8.6   5.8   1.0   NaN  8.2
Mike    13.0  -1.4  24.6  29.8 -0.2
Andi     1.8   8.2  16.6  -1.8  6.6
Paul    29.8  21.8   5.8  13.0 -2.2